<!DOCTYPE html>
<html>
<head>
<style>
div {
  float: left;
  width: 140px;
  margin: 1 0 55px 50px;
  padding: 20px;
  border: 2px solid white;
  text-align: center;
}

body{
        background-image: url(siguri.jpg);
        background-size: 1750px 4000px;
        background-repeat: no-repeat;

       }

    h1{
       color:rgba(255,255,255,1.0);
       margin-top: 200;
       margin-bottom: 50;
       font-family: Century Gothic;
       font-size: 450%;

}
     h3{color:rgba(0,0,0,1.0);
        background-image:url(white.jpg);
        padding-top: 0.3%;
        padding-bottom: 0.3%;
        margin-top:0;
        margin-bottom: 0;
        white-space: nowrap; 
        width: 1570px; 
        border: 1px solid #000000;
        overflow: hidden;
        text-overflow: ellipsis;
        font-family: Century Gothic;
}

h4 {color:rgba(255,255,255,1.0);
     margin-top: 100;
     margin-bottom: 300;
     font-family: Century Gothic;
     font-style: normal;
     
}

p {color:rgba(255,255,255,1.0);
   margin-top: 200;
   margin-bottom: 400;
   font-family: Century Gothic;
   font-style: normal;

}
li {color:rgba(255,255,255,1.0);
   margin-top: 200;
   margin-bottom: 500;
   font-family: Century Gothic;
   font-style: normal;

}


img {
  opacity: 0.5;

}

img:hover {
  opacity: 1.0;
 
}

a:hover, a:active {
  background-color: white;
 
}




h5{color:rgba(255,255,255,1.0);
     margin-top: 20;
     margin-bottom: 20;
     font-family: Century Gothic;
     }

{
  box-sizing: border-box;

}



a:link{
       text-decoration:none;
       color: black;
       }

</style>
</head>
<body>

<h1 align="right">CyberSecurity Wisdom</h1>

   <h3 align="right" ><a href="index.html">Home</a>|
                       <a href="Siguri.html">Siguri</a>|
                       <a href="FAQ.html">FAQ</a>|
                       <a href="Tools.html">Tools</a>|
                       <a href="formulari.html">Formulari</a></h3>

   <h4 align="center" ;>INFORMACION:</h4>

<div>
<img src="securityscarf.jpg" width="150" height="130" ><br><p>M&euml;nyra m&euml; e mir&euml; p&euml;r t&euml; siguruar pajisjet tuaja Apple</p>
</div>
<p>
</br>Siguria n&euml; Internet nuk &euml;sht&euml; vet&euml;m p&euml;r desktop tuaj m&euml;. Shumica e p&euml;rdoruesve t&euml; Apple t&euml; mbledh&euml;, 
dyqan, dhe transferimit t&euml; t&euml; dh&euml;nave me pajisje t&euml; shumta, m&euml; s&euml; shumti iPhone, iPad, dhe iPod Touch. 
P&euml;r fat t&euml; mir&euml;, ExpressVPN ka Apps p&euml;r t&euml; mbrojtur lidhjen midis t&euml; gjitha k&euml;tyre pajisjeve dhe me pjes&euml;n tjet&euml;r t&euml; internetit , 
por &euml;sht&euml; e dobishme q&euml; t&euml; ket&euml; disa truket shtes&euml; deri m&euml;ng&euml; tuaj p&euml;r t&euml; mbrojtur ato produkte Apple dhe t&euml; dh&euml;nat personale q&euml; ato p&euml;rmbajn&euml;.
</br>Lexo m&euml; p&euml;r nj&euml; udh&euml;zues p&euml;r sigurimin pajisjet tuaja Apple.
</p>

<p>
<b><u>Apple e mori shpin&euml;n</u></b></br>
N&euml;se ju jeni nj&euml; klient Apple, shumica e pun&euml;s n&euml; sigurimin e t&euml; dh&euml;nave tuaja &euml;sht&euml; b&euml;r&euml; tashm&euml; p&euml;r ju. 
Politika Apple privacy &euml;sht&euml; i pakaluesh&euml;m, duke fituar at&euml; me 5 nga 5 yje t&euml; mundsh&euml;m n&euml; EFF-s&euml; vjetore Kush ka shpin&euml;n? raporti . 
Apple &euml;sht&euml; shum&euml; i qart&euml; n&euml; lidhje me se sa larg do t&euml; shkoj&euml; n&euml; p&euml;rputhje me k&euml;rkesat e zbatimit t&euml; ligjit p&euml;r t&euml; dh&euml;nat e konsumator&euml;ve t&euml; saj,
 dhe &euml;sht&euml; e hapur n&euml; refuzimin e backdoors qeveris&euml; p&euml;r produktet e saj.
P&euml;r m&euml; tep&euml;r, n&euml; versionet e fundit t&euml; pajisjeve iOS, Apps t&euml; komunikimit parazgjedhur ( iMessage dhe FaceTime ) si dhe 
backup app iCloud encrypt t&euml; gjitha t&euml; dh&euml;nat fund-te-fund by default . Kjo i jep pajisje t&euml; Apple nj&euml; nivel t&euml; respektuar baz&euml; t&euml; siguris&euml; t&euml; drejt&euml; t&euml; dal&euml; nga kutia.
Megjithat&euml;, m&euml; posht&euml; jan&euml; disa k&euml;shilla t&euml; thjeshta p&euml;r t&euml; marr&euml; sigurin&euml; tuaj celular edhe m&euml; tej.
</br>
</p>
<ol>
</br></br></br><li><b>Vendosni nj&euml; kodkalim</b></br></br>
Kjo mund t&euml; duket e qart&euml;, por me t&euml; gjith&euml; flasin p&euml;r sigurin&euml; digjitale &euml;sht&euml; e leht&euml; t&euml; harrojm&euml;:
 nganj&euml;her&euml; m&euml;nyra m&euml; e leht&euml; p&euml;r dik&euml; q&euml; t&euml; vjedhin t&euml; dh&euml;na nga telefoni juaj &euml;sht&euml; p&euml;r t&euml; fjal&euml; p&euml;r fjal&euml; t&euml; vjedhur telefonin tuaj .
 Vendosja e nj&euml; kodkalim kujdeset q&euml; duke k&euml;rkuar q&euml; ju t&euml; hyj&euml; n&euml; nj&euml; 4-shifror kod numerik p&euml;r t&euml; hyr&euml; n&euml; pajisjen tuaj 
(ose n&euml;se preferoni, nj&euml; kod m&euml; t&euml; gjat&euml; numerik, ose nj&euml; kod alfa-numerike, apo edhe nj&euml; gjurm&euml; gishtash me Touch ID ).
</li>
</br><li>P&euml;rdorin verifikimin dy hapa</b></br></br>
Dy-hap i verifikimit &euml;sht&euml; nj&euml; mjet i madh t&euml; siguris&euml; t&euml; ofruara nga sh&euml;rbimet si Google dhe Dropbox, 
dhe ju mund t&euml; merrni at&euml; p&euml;r sh&euml;rbimet e Apple si iCloud dhe iTunes shum&euml;. P&euml;r t&euml; p&euml;rdorur at&euml;, 
regjistrohen telefonin tuaj (ose nj&euml; tjet&euml;r pajisje t&euml; besuar) n&euml; ID tuaj Apple . 
At&euml;her&euml; sa her&euml; q&euml; ju hyni me at&euml; Apple ID, ju do t&euml; k&euml;rkohet p&euml;r fjal&euml;kalimin tuaj dhe nj&euml; kod verifikimit SMS, n&euml; m&euml;nyr&euml; p&euml;r t&euml; fituar qasje.
 Kjo do t&euml; thot&euml; edhe n&euml; qoft&euml; se nj&euml; sulmues ka vjedhur fjal&euml;kalimin tuaj Apple ID, ata ende nuk do t&euml; jet&euml; n&euml; gjendje p&euml;r t&euml; hyr&euml; n&euml; t&euml; dh&euml;nat tuaja 
iCloud apo t&euml; bler&euml; p&euml;rmbajtje iTunes n&euml;se ata kan&euml; t&euml; vjedhur fizikisht telefonin tuaj dhe t&euml; vjedhur kodkalimin e keni vendosur n&euml; hapin e m&euml;parsh&euml;m. 
Kjo &euml;sht&euml; m&euml; se e mjaftueshme p&euml;r t&euml; penguar t&euml; gjith&euml;, por hajdut&euml; t&euml; dh&euml;nave m&euml; t&euml; motivuar.</li>
</br><li><b>Encrypt backups tuaj iTunes</b></br></br>
N&euml;se ju kan&euml; p&euml;rmbajtje personal n&euml; iTunes tuaj dhe ju p&euml;rs&euml;ri at&euml; duke p&euml;rdorur iCloud, q&euml; t&euml; dh&euml;nat &euml;sht&euml; koduar tashm&euml; me nj&euml; minimum prej 128-AES encryption
 (sh&euml;nim: bler&euml; p&euml;rmbajtje nuk &euml;sht&euml; e koduar). Por ajo q&euml; ju nuk mund t&euml; dini &euml;sht&euml; se ju mund t&euml; vendosni iTunes p&euml;r t&euml; encrypt kopje lokale n&euml; iPhone tuaj, 
iPod, iPad apo si. P&euml;r ta b&euml;r&euml; k&euml;t&euml;, lidhni pajisjen tuaj me kompjuterin tuaj dhe zgjidhni “Encrypt iPhone / iPad / iPod backup” n&euml; preferencat panelin Backups.
</li>
</br><li><b>P&euml;rdorni Gjej postimet e mia iPhone / iPad</b></br></br>
Gjej iPhone ime &euml;sht&euml; nj&euml; tjet&euml;r mjet i madh i siguris&euml; p&euml;r pajisjen tuaj iOS. &EUML;sht&euml; tep&euml;r e dobishme kur pajisja juaj merr humbur ose t&euml; vjedhur. 
P&euml;r t&euml; p&euml;rdorur at&euml;, vet&euml;m t&euml; regjistroheni n&euml; iCloud nga nj&euml; kompjuter tjet&euml;r. N&euml;se pajisja juaj &euml;sht&euml; vet&euml;m humbur n&euml; sht&euml;pin&euml; tuaj diku, ju mund 
ta detyroj&euml; pajisjen p&euml;r t&euml; luajtur nj&euml; tingull p&euml;r t&euml; ndjekur at&euml; posht&euml;. N&euml;se pajisja juaj &euml;sht&euml; e humbur apo vjedhur, ju mund t&euml; gjeni pajisjen tuaj 
vjedhur n&euml; nj&euml; hart&euml;, bllokohet at&euml;, ose distanca fshihet at&euml;. Edhe n&euml; qoft&euml; se pajisja juaj &euml;sht&euml; mund&euml;suar off ose jo t&euml; lidhur, gj&euml; q&euml; ju b&euml;ni nga Find My iPhone 
do t&euml; hyj&euml; n&euml; fuqi her&euml;n tjet&euml;r pajisja shkon n&euml; internet .
Duke folur p&euml;r fshirja e t&euml; dh&euml;nave n&euml; pajisje t&euml; l&euml;vizshme * tuaj, kjo nuk &euml;sht&euml; nj&euml; hap i keq i par&euml; n&euml; qoft&euml; se jeni duke planifikuar p&euml;r t&euml; shitur ose dh&euml;n&euml;
 larg iPhone tuaj, iPod, iPad apo shpejt. Ndiqni k&euml;t&euml; udh&euml;zues p&euml;r fshirje t&euml; t&euml; dh&euml;nave nga pajisjen tuaj para se t&euml; l&euml; n&euml; duart tuaja.
* P&euml;r t&euml; sigurt fshir&euml; t&euml; dh&euml;nat nga Mac desktop apo laptop, p&euml;rdorni “t&euml; sigurt&euml; Trash Empty” option. N&euml; krahasim me “Trash Bosh”, q&euml; thjesht sh&euml;non zon&euml;n ku t&euml; 
dh&euml;nat tuaja &euml;sht&euml; ruajtur si n&euml; dispozicion p&euml;r p&euml;rdorim, “Sigurt Trash zbraz&euml;t” n&euml; fakt shkruan t&euml; dh&euml;na t&euml; rastit mbi zon&euml;n p&euml;r t&euml; parandaluar t&euml; dh&euml;nat e sh&euml;rimit. 
N&euml;se doni edhe m&euml; shum&euml; mbrojtje, Disk Utility (nj&euml; nd&euml;rtuar n&euml; app n&euml; Mac tuaj) mund t&euml; shkruajn&euml; mbi p&euml;rmbajtjen e kujtes&euml;s deri n&euml; 7 her&euml;.
</li>
</br><li><b>Menaxho privat&euml;sin&euml; tuaj</b></br></br>
<p>Si&ccedil; u p&euml;rmend m&euml; par&euml;, t&euml; dh&euml;nat e admirueshme Apple udh&euml; siguris&euml; do t&euml; thot&euml; tuaj iPhones, iPods, iPads, dhe Macs 
jan&euml; t&euml; arsyeshme t&euml; mir&euml;-mbrojtur nga default, por n&euml;se ju jeni ndonj&euml;her&euml; t&euml; shqet&euml;suar p&euml;r t&euml; dh&euml;nat e pajisja juaj 
mund t&euml; jet&euml; d&euml;rguar n&euml; dhe nga iCloud, iTunes, ose çdo aplikim tjet&euml;r n&euml; telefonin tuaj, lexoni udh&euml;zuesin e Apple p&euml;r t&euml; m&euml;suar 
m&euml; shum&euml; rreth asaj se si p&euml;r t&euml; menaxhuar parametrat tuaj t&euml; privat&euml;sis&euml;.
</p>
</ol>

</br>
<div></br>
<img src="metaspoit.png" width="150" height="130" ><br><p>&Ccedil;far&euml; &euml;sht&euml; Metasploit</p>
</div>

<p></br></br><b>Metasploit &euml;sht&euml; nj&euml; mjet i preferuar per ekspert&euml; t&euml; siguris&euml; kibernetike dhe gjithashtu &euml;sht&euml; p&euml;rdorur nga hakerat.</b></br></br>
Ajo p&euml;rdoret kryesisht n&euml; testimin e penetrimit dhe zhvillimin e n&euml;nshkrimit t&euml; IDS.
Mjeti i siguris&euml; Metasploit mori nj&euml; p&euml;rdit&euml;sim masiv. I quajtur si Metasploit 5.0, ka shum&euml; p&euml;rmir&euml;sime, 
si nj&euml; baz&euml; t&euml; dh&euml;nash t&euml; re, nj&euml; API t&euml; automatizuar, module t&euml; evazionit dhe biblioteka.
P&euml;r m&euml; tep&euml;r, ajo merr nj&euml; rritje n&euml; performanc&euml;n, si dhe n&euml; aspektin e p&euml;rdorshm&euml;ris&euml; s&euml; mjetit. Pas vitit 2011, 
Metasploit nuk mori ndonj&euml; p&euml;rdit&euml;sim ose p&euml;rmir&euml;sime n&euml; lidhje me funksionalitetin.
Versioni i korniz&euml;s (i dedikuar p&euml;r zhvilluesit) t&euml; Metasploit tani ofron mb&euml;shtetje p&euml;r dy gjuh&euml; programimi p&euml;rveç Ruby – Python dhe Go.
Duke ardhur n&euml; dy versionet e tjera, Metasploit Community dhe Metasploit Pro, t&euml; dy prej tyre vijn&euml; me funksion automatizimi edhe pse ky i fundit ka shum&euml; karakteristika m&euml; t&euml; p&euml;rparuara.
Metasploit Pro &euml;sht&euml; i ngarkuar me shum&euml; mund&euml;si testimi. Disa prej tyre p&euml;rfshijn&euml; MetaModules, integrimet n&euml;p&euml;rmjet Remote API, Shfryt&euml;zimi i zgjuar, Forcimi automatik i brutalitetit, 
vlefshm&euml;ria e cenueshm&euml;ris&euml; s&euml; mbyllur t&euml; loop-it, menaxhimi i nd&euml;rgjegj&euml;simit t&euml; phishing, nd&euml;r t&euml; tjera.
</br>

</p></br>

</br></br></br></br></br>
<div></br>
<img src="nessus.png" width="160" height="110" ><br><p>Nessus Vulnerability Scanner</p>
</div>

</br><p></br><b>
Tenable Security’s Nessus &euml;sht&euml; nj&euml; nga skanuesit m&euml; t&euml; p&euml;rdorur gjer&euml;sisht.</b></br></br>
Nessus database p&euml;rfshin vulnerabilitete p&euml;rtej platformave dhe protokolleve. 
Nessus &euml;sht&euml; n&euml; versionin profesional p&euml;r t&euml; cilin duhet t&euml; paguash dhe versionin free i cili quhet Nessus Home. 
Nessus Home nuk ofron skanimin e m&euml; shum&euml; se 16 adresave IP . 
Duhet p&euml;rmendur q&euml; Nessus nuk &euml;sht&euml; e instaluar paraprakisht n&euml; Kali Linux.
P&euml;rpara se t&euml; perdorim Nessus duhet fillimisht t&euml; nisim me Nessus daemon. Shkojme n&euml; command line dhe shkruajm&euml; <i><u>service nessusd start</u></i>.


</p></br>

</br></br></br></br></br>
<div></br>
<img src="hacking.jpg" width="160" height="110" ><br><p>HACKING</p>
</div>

</br><p></br><b>
&Ccedil;far&euml; &euml;sht&euml; nj&euml; haker?</b></br></br>
Hacker &euml;sht&euml; nj&euml; fjal&euml; q&euml; ka 2 kuptime:
Tradicionalisht nj&euml; haker &euml;sht&euml; nj&euml; njeri t&euml; cilit i p&euml;lqen t&euml; luaj&euml; me programe dhe sisteme elektronike. Hakerat p&euml;lqejn&euml; t&euml; eksplorojn&euml; dhe t&euml; m&euml;sojn&euml; se si sistemet kompjuterike punojn&euml;.
Ata dashurojn&euml; t&euml; gjejn&euml; m&euml;nyra t&euml; reja sesi t&euml; punojn&euml; n&euml; m&euml;nyr&euml; elektronike. Koh&euml;t e fundit fjala haker ka marr&euml; edhe nj&euml; kuptim tjet&euml;r: nj&euml; njeri i keq dhe i djall&euml;zuar q&euml; futet n&euml; sistemet e kompjuterave p&euml;r arsye t&euml; tyre personale, fame, fitim ose p&euml;r hakmarrje. Ata modifikojn&euml;, fshijn&euml;, stilojn&euml; informacione kritike.
<br><b>Llojet e hakerave:</b></br>
<br><br>1. White Hat Hacker – White hat haker &euml;sht&euml; nje person i cili performon haking etik.
<br>2. Black Hat Hacker – Black hat haker &euml;sht&euml; nje person i cili performon haking joetik.
<br>3. Grey Hat Hacker – Grey hat hacker &euml;sht&euml; nje person i cili performon here keq dhe here mir&euml;.
<br><br><b>Mjetet q&euml; p&euml;rdorin hackerat:</b>
<br>• R.A.T – Remote Administration Tools. K&euml;to mjete mund t&euml; marrin kontrollin e plot&euml; t&euml; kompjuterit t&euml; infektuar dhe kan&euml; shum&euml; funksione si keyloggeri, screenrecorder, kontrollin e mausit dhe t&euml; tastjer&euml;s etj.
<br>• Keylogger – &euml;sht&euml; nje mjet q&euml; sh&euml;rben per t&euml; p&euml;rgjuar tastierat.
<br>• Crypters – K&euml;to mjete b&euml;jn&euml; q&euml; virusi t&euml; mos zbulohet nga nj&euml; Anti-Virus. 
<br>• BruteForce – BruteForce &euml;sht&euml; nj&euml; m&euml;nyr&euml; p&euml;r t&euml; thyer sigurin&euml; duke provuar t&euml; gjith&euml; kombinimet e mundshme t&euml; fjal&euml;kalimeve. 
<br>• Sniffers, DDOSers, Port scanners, Vulnerability Scanners, etj.



</p></br>


<div></br>
<img src="viruset.jpg" width="160" height="110" ><br><p>VIRUSET</p>
</div>

</br><p></br><b>
&Ccedil;far&euml; jan&euml; viruset? </b>
</br></br>Virus &euml;sht&euml; fjal&euml; e p&euml;rgjithshme p&euml;r programe keqb&euml;r&euml;se q&euml; jan&euml; t&euml; aft&euml; t&euml; infektojn&euml; kompjuterat dhe t&euml; shp&euml;rndahen. Viruse nuk lindin vetvetiu por programohen nga specialist&euml;t e kompjuterave p&euml;r t&euml; kryer funksione t&euml; ndryshme. Viruset kan&euml; p&euml;r q&euml;llim d&euml;mtimin e skedar&euml;ve, fshirjen e memorjes, p&euml;rgjimin dhe spiunimin, vjedhjen e informacionit, ngadal&euml;simin e rrjeteve kompjuterike, etj.
</br></br><b>Si hyjn&euml; n&euml; kompjuter?</b></br>
Virus&euml;t shp&euml;rndahen me t&euml; gjitha m&euml;nyrat q&euml; shp&euml;rndahen edhe skedar&euml;t e tjer&euml;. Ata mund t&euml; shkarkohen nga Interneti, mund t&euml; jen&euml; bashk&euml;ngjitur n&euml; email, mund t&euml; hyjn&euml; nga kompjuterat e tjer&euml;, nga disketat, CD, etj. Disa viruse p&euml;hapen vetvetiu duke shfryt&euml;zuar dob&euml;si t&euml; sistemit operativ (Windows, Linux, Mac, etj), por shumica e tyre merren n&euml; kompjuter nga vet&euml; p&euml;rdoruesi.
</br></br><b>Si t&euml; mbrohem prej virus&euml;ve?</b></br>
Mbrojtja m&euml; e mir&euml; &euml;sht&euml; q&euml; t’i parandalosh dhe mos t’u jap&euml;sh mund&euml;si t&euml; infektoj&euml; skedar&euml;t e kompjuterit. Po arrit&euml;n t&euml; infektoj&euml; kompjuterin, ateher&euml; nuk ke garanci se kompjuteri mund t&euml; pastrohet plot&euml;sisht. Viruset q&euml; kan&euml; p&euml;r q&euml;llim vjedhjen ose spiunimin zakonisht pastrohen pa problem, por viruset q&euml; d&euml;mtojn&euml; skedar&euml;t e sistemit operativ zakonisht nuk mund t&euml; pastrohen dhe t&euml; detyrojn&euml; t&euml; fshish gjith&Ccedil;ka q&euml; ke n&euml; kompjuter dhe t&euml; fillosh nga fillimi. Sistemi operativ nuk &euml;sht&euml; i aft&euml; t&euml; mbroj&euml; kund&euml;r viruseve, prandaj nevojiten programe antiviruse q&euml; jan&euml; t&euml; aft&euml; t&euml; zbulojn&euml; viruset dhe t&euml; mbrojn&euml; kund&euml;r infektimit.
</br></br><b>Si punojn&euml; antivirus&euml;t?</b></br>
Antivirus&euml;t kan&euml; nj&euml; list&euml; t&euml; madhe t&euml; viruseve t&euml; njohur dhe monitorojn&euml; kompjuterin gjat&euml; gjith&euml; koh&euml;s p&euml;r t&euml; zbuluar n&euml;se ndonj&euml; prej tyre &euml;sht&euml; futur n&euml; kompjuter. Kriminel&euml;t e kompjuterave nd&euml;rtojn&euml; viruse t&euml; rinj &Ccedil;do dit&euml;, prandaj edhe lista e viruseve duhet p&euml;rdit&euml;suar shpesh. Kompania q&euml; ka prodhuar antivirusin studion viruset e rinj dhe publikon p&euml;rdit&euml;simet q&euml; mund&euml;sojn&euml; zbulimin, mbrojtjen dhe luftimin kund&euml;r infeksioneve. Disa antiviruse p&euml;rdit&euml;sohen automatikisht, nd&euml;rsa disa t&euml; tjer&euml; duhet t&euml; p&euml;rdit&euml;sohen nga p&euml;rdoruesi i kompjuterit, zakonisht duke shkarkuar dhe instaluar p&euml;rdit&euml;simet nga faqja e kompanis&euml; n&euml; Internet. P&euml;rve&ccedil; monitorimit t&euml; kompjuterit, antivirus t&euml; jep mund&euml;sin&euml; t&euml; b&euml;sh nj&euml; kontroll (ose scan) t&euml; t&euml; gjith&euml; skedar&euml;ve t&euml; kompjuterit. Kontrolli k&euml;shillohet t&euml; b&euml;het t&euml; pakt&euml;n nj&euml;her&euml; n&euml; muaj, sidomos p&euml;r kompjuterat q&euml; shk&euml;mbejn&euml; informacion n&euml; Internet, n&euml; rrjetet lokale, ose me disketa, CD, etj.
</br></br><b>A mjafton antivirusi?</b></br>
Instalimi i antivirusit &euml;sht&euml; i domosdosh&euml;m dhe ofron mbrojtje kund&euml;r viruseve por n&euml; bot&euml;n kompjuterike rreziku nuk vjen vet&euml;m nga viruset. Ka dhe programe t&euml; tjera q&euml; b&euml;jn&euml; reklama, ndryshojn&euml; konfigurimin e kompjuterit, ngadal&euml;sojn&euml; Internetin, hapin dyer t&euml; fshehta n&euml; kompjuter, p&euml;rgjojn&euml; informacionin q&euml; shk&euml;mbehet, vjedhin fjal&euml;kalimet, etj. Nuk ka asnj&euml; program q&euml; t&euml; mbroj&euml; kund&euml;r gjith&euml; k&euml;tyre rreziqeve, prandaj &euml;sht&euml; detyra e p&euml;rdoruesit t&euml; kompjuterit q&euml; t&euml; tregoj&euml; kujdes dhe t&euml; mir&euml;mbaj&euml; kompjuterin.

</p></br>
</br>
<div></br>
<img src="worm.jpg" width="160" height="110" ><br><p>WORM</p>
</div>

</br><p></br>
Worm-et tashm&euml; jan&euml; p&euml;rfshir&euml; prej koh&euml;sh n&euml; kategorin&euml; e viruseve me rrezikshm&euml;ri t&euml; lart&euml;. Worm-et jan&euml; t&euml; ngjash&euml;m me viruset sepse vet&euml;-shumohen, por krimbat nuk kan&euml; nevoj&euml; p&euml;r nj&euml; skedar p&euml;r t’u shp&euml;rndar&euml;, vet&euml;-shumohen duke infektuar fillimish sistemin dhe m&euml; pas duke u shp&euml;rndar&euml; n&euml; rrjet infektojn&euml; edhe kompjutera t&euml; tjer&euml;.
</br></br><b>Ka dy lloje kryesore t&euml; worm-eve:</b>
</br>1.Worm-et e email-eve massive (mass-mailing worms) t&euml; cil&euml;t p&euml;rdorin email-in si nj&euml; rrug&euml; p&euml;r t&euml; infektuar kompjuterat e tjer&euml;.
</br>2.Worm-et e rrjeteve (Network-aware worms) t&euml; cil&euml;t jan&euml; nj&euml; problem shum&euml; i madh p&euml;r Internetin. Ato zgjedhin nj&euml; target dhe sapo targeti i tyre t&euml; aksesohet e infektojn&euml; at&euml; n&euml;p&euml;rmjet nj&euml; trojani ose diçkaje tjet&euml;r.
Disa nga worm-et me t&euml; famshme jan&euml;: Melissa, I Love You, Nimda, etj.



</p></br>






  <h5>Kliko <mark style="background-color:rgba(255,255,255,1.0);"><a href="formulari.html" align="left">k&eumltu </a></mark> p&eumlr tu b&eumlr&euml pjes&euml e komunitetit</h5>






</body>